/*

Разберите программу.

*/

#include "Exemple_1.h"
#include "Exemple_2.h"
#include "HW_1.h"
#include "HW_2.h"
#include "HW_3.h"
#include "HW_4.h"

int main() {
    HW_3();

    return 0;
}

/*

+ Упражнение 1.1.
Почему столько раз вызывается деструктор?

+ Упражнение 1.2.
Змените способ перачи входных данных в функции operator+() с передачи по значению, на передачу по адресу.

+ Упражнение 2.1.
Создайте класс для вычисления чисел Фибоначчи. Каждое число фибоначи является объектом этого класса,
которое имеет атрибуты: значение и номер. Используйте функции для инициализации (вычисления) чисел
Фибоначчи как сторонние по отношению к этому классу.

Упражнение 2.2.
Поместите функции для вычисления чисел Фибоначчи внутрь созданного класса.

Упражнение 2.3.
Напишите функцию выполняющую операцию сложения двух чисел Фибоначи как операцию с
номерами чисел Фибоначи. В результате работы этой функции создаётся новый экземпляр этого класса.

Упражнение 2.4.
Перегрузите операции сложения, вычитания, умножения и деления для созданного класса как операции с
номерами чисел Фибоначи.

*/